app/controllers/notes_controller.rb

	def index
		@notes = Note.all
---
SELECT "notes".* FROM "notes"

	def show
		@note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]

	def edit
		@note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]

	def create
		@note = Note.new(params[:note])
		@note.save
---
INSERT INTO "notes" ("color", "content", "created_at", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["color", "red"], ["content", "content 1"], ["created_at", Wed, 03 Apr 2013 14:06:30 UTC +00:00], ["status", "open"], ["title", "note 1"], ["updated_at", Wed, 03 Apr 2013 14:06:30 UTC +00:00]]

	def update
		@note = Note.find(params[:id])

		respond_to do |format|
			if @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "notes" SET "content" = 'pouet yeah !', "updated_at" = '2013-04-05 11:31:52.473653', "data" = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess

	def destroy
		@note = Note.find(params[:id])
		@note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]